[
    {
        "title": "Interactive Visualization for Glucose Data",
        "year": 2025,
        "image": "../images/foods.jpg",
        "description": "This is an interactive visualization that allows users to learn how glucose levels varies between individuals and the factors that contribute to diabetes. It also explores how the same food can affect glucose levels differently in different people."
    },
    {
        "title": "Kaggle Data Mining Competition",
        "year": 2025,
        "image": "../images/airbnb.jpg",
        "description": "Placed top 25 out of 100+ participants in a Kaggle competition where the objective was to build the best machine learning model to predict AirBnb listing prices."
    },
    {
        "title": "Interative Bike Map of Boston and Cambridge",
        "year": 2025,
        "image": "../images/bikes.png",
        "description": "This is an interactive map that visualizes the bike paths in Boston and Cambridge, Massachusetts. Users can explore the vast network of BlueBike stations and also see how traffic congestion varies throughout the day"
    },
    {
        "title": "LinkedIn Salary Prediction",
        "year": 2025,
        "image": "../images/LinkedIn.jpg",
        "description": "Are we able to accurately predict the salary of a certain job listing given its listing details? After intensive data-preprocessing, a Random Forest Regressor was employed that achieved an R-squared of 0.83 and a mean absolute error of ~$6028.89."
    },
    {
        "title": "Textual Sentiment and Recipe Ratings",
        "year": 2024,
        "image": "../images/recipe.jpg",
        "description": "Can sentiment analysis of recipe descriptions and reviews help us accurately predict recipe ratings? Using a Random Forest Classifier, a ~72% accuracy was achieved and while this is not extraordinary, there is certainly a significant influence of textual features. "
    },
    {
        "title": "Regression Analysis on News Popularity",
        "year": 2024,
        "image": "../images/news.jpg",
        "description": "Using a dataset with a heterogeneous set of features about articles published by Mashable in a span of two years, this project found 13 of the most predictive variabltes of new shares (popularity)."
    },
    {
        "title": "Personalized Genetic Report for Weight Loss",
        "year": 2024,
        "image": "../images/genetics.jpg",
        "description": "As part of my most recent internship, I create a pipeline in AWS to dynamically generate personalized genetic reports for weight loss. This leveraged the capabilities of AWS Lambda, S3, and RDS to create a scalable solution that can handle large datasets stored in PostgreSQL."
    },
    {
        "title": "Flight Fare Forecasting",
        "year": 2024,
        "image": "../images/airplane.jpg",
        "description": "Are we able to accurately predict flight costs based on the route, distance, and seasonality? To carry this out, a Random Forest Regressor was employed that ultimately achieved a R-squared of 0.93 and a ~5.1% mean absolute pecentage error."
    },
    {
        "title": "Predictive Model for Restock Periods",
        "year": 2023,
        "image": "../images/inventory.jpg",
        "description": "In effort to help a startup company make better data-driven decisions, I built an Excel model that predicts the restock period of 34 products. I also created an interactive Tableau dashboard that visualized their KPIs and growth trends."
    }
]